// STL——标准模板库
// 广义分为：容器  算法  迭代器
// 容器和算法之间通过迭代器无缝衔接
// STL几乎所有代码都采用了模板类或者模板函数

// 大体分为六大组件：容器      算法    迭代器      仿函数      适配器      空间配置器
// 1.容器：各种数据结构，如vector,list,deque,set,map等用来存放数据
// 2.算法：各种常用的算法，如sort,find,copy,for_each等
// 3.迭代器：扮演了容器和算法之间的胶合剂
// 4.仿函数：行为类似函数，可作为算法的某种策略
// 5.适配器：一种用来修饰容器或者仿函数或得带器接口的东西
// 6.空间配置器：负责空间的配置和管理

// 常用的数据结构：数组，链表，树，栈，队列，集合，映射表等
// 容器分为序列式容器和关联式容器
//     序列式容器：强调值的排序，每个元素都有固定的位置
//     关联式容器：二叉树结构，各元素之间没有严格的物理上的顺序关系

// 算法(Algorithms)
// 分为质变算法(拷贝、替换、删除等)和非质变算法（查找、计数、遍历等）

// 迭代器使用类似于指针
    // 输入迭代器      输出迭代器      前向迭代器  双向迭代器    随机迭代器访问迭代器



